{
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "books": [
    {
      "author": "Blanka Lipińska",
      "title": "365 dni",
      "desc": "Obrzydliwie romantyczna, skrajnie prawdziwa i inspirująca... Laura wraz ze swoim chłopakiem Martinem i dwójką przyjaciół wyjeżdżają na wakacje na Sycylię. Drugiego dnia pobytu – w swoje dwudzieste dziewiąte urodziny – dziewczyna zostaje porwana. Porywaczem okazuje się głowa sycylijskiej rodziny mafijnej, szalenie przystojny, młody don Massimo Toricelli. Mężczyzna kilka lat wcześniej przeżył zamach na swoje życie. Postrzelony kilka razy prawie umarł, a kiedy jego serce przestało bić, przed oczami zobaczył dziewczynę, a dokładnie Laurę Biel. Gdy przywrócono go do życia, obiecał sobie, że odnajdzie kobietę, którą zobaczył. Massimo daje dziewczynie 365 dni na to, by go pokochała i z nim została. „Ojciec chrzestny” w połączeniu z „Pięćdziesięcioma twarzami Greya”.",
      "years": 2018,
      "rating": [],
      "url": "https://s.lubimyczytac.pl/upload/books/4850000/4850591/666969-170x243.jpg",
      "id": 1
    },
    {
      "author": "Blanka Lipińska",
      "title": "Kolejne 365 dni",
      "desc": "Ciężarna Laura zostaje postrzelona. Najlepsi lekarze walczą o życie kobiety. Jej mąż, głowa sycylijskiej mafii, musi podjąć najtrudniejszą decyzję w swoim życiu - kogo ocalić: ukochaną czy ich dziecko... Jakiego wyboru dokona Massimo? Czy życie bez Laury będzie miało dla niego jeszcze sens? Czy będzie potrafił w pojedynkę wychować ich syna? Miliony myśli kłębią mu się w głowie, ale żadna nie przynosi ukojenia. Nie wie, jak potoczą się losy jego rodziny. Czyje 365 dni będziemy śledzić w trzeciej części sagi?\n\"Kolejne 365 dni\" to kontynuacja bestsellerowej serii Blanki Lipińskiej o Laurze Biel porwanej przez szefa sycylijskiej mafii. Poprzednie książki, „365 dni” i „Ten dzień”, sprzedały się w nakładzie ponad 500 000 egzemplarzy. Pełna erotyzmu i sensacyjnych zwrotów akcji powieść, porównywana do światowego bestsellera „50 twarzy Greya”, podbiła serca polskich kobiet. Jeśli komuś się wydaje, że Lipińskiej trudno będzie znów zaskoczyć czytelników, to powinien zapiąć pasy, bo \"Kolejne 365 dni\" jest niczym jazda rollercosterem!\nTrwają prace nad ekranizacją serii. Premiera filmu planowana jest na walentynki 2020 roku.",
      "years": 2020,
      "rating": [],
      "url": "https://s.lubimyczytac.pl/upload/books/4873000/4873462/729808-170x243.jpg",
      "id": 2
    },
    {
      "author": "Adam Mickiewicz",
      "title": "Pan Tadeusz ",
      "desc": "asld dlsfk sdfkl ldksfkldsfk kdfsl kf ksd",
      "years": 2022,
      "rating": [
        5
      ],
      "url": "https://s.lubimyczytac.pl/upload/books/4936000/4936657/836580-170x243.jpg",
      "id": 4
    },
    {
      "author": "Jan Kochanowski",
      "title": " Lista dzieł Jana Kochanowskiego.",
      "desc": "Odpis wczesnej redakcji łacińskich Elegii, znacznie różniącej się od wersji drukowanej z 1584 (zob. poz. XXXI), znajdujący się w rękopisie Jana Osmólskiego z Prawiednik (tzw. „Sylwa Osmólskiego”). Przyjmuje się, że teksty Kochanowskiego wpisano do rękopisu ok. 1562 r. Obok elegii wczesnej redakcji, w rękopisie znajduje się odpis wczesnych redakcji dwóch wierszy poety, zapisanych bez oznaczania autora. Są to: A. Pieśń zaczynająca się od słów: „Oko śmiertelne Boga nie widziało” wydana we Fragmentach (zobacz pozycja 40) jako Pieśń III; B. Gratiarum Actio pro victu,",
      "years": 1900,
      "rating": [
        5
      ],
      "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Odprawa.jpg/220px-Odprawa.jpg",
      "id": 5
    },
    {
      "author": "Blanka Lipińska",
      "title": "365 dni",
      "desc": "Powieść była nominowana do nagrody Bestsellery Empiku w kategorii literatura polska[1][2]. Książka rozeszła się w nakładzie ponad 100 tys. egzemplarzy[3].\n\nPowieść została zekranizowana, a film 365 dni wyreżyserowała Barbara Białowąs. Premiera filmu odbyła się w 2020, a główne role zagrali w niej Anna-Maria Sieklucka jako Laura Biel i Michele Morrone jako Don Massimo Torricelli. Film był najczęściej oglądaną polską produkcją w kinach w 2020, za co został nagrodzony Bursztynowymi Lwami podczas 45. Festiwalu Polskich Filmów Fabularnych w Gdyni[4]. Po międzynarodowej premierze na Netflixie ekranizacja była najpopularniejszym filmem na tej platformie w 2020[5].",
      "years": 2016,
      "rating": [
        5
      ],
      "url": "https://ecsmedia.pl/c/365-dni-w-iext115627841.jpg",
      "id": 6
    },
    {
      "author": "BLANKA LIPIŃSKA",
      "title": "xd",
      "desc": "sadasd",
      "years": 2022,
      "rating": [
        5
      ],
      "url": "sdasd",
      "id": 7
    },
    {
      "author": "Zbigniew Herbert",
      "title": "Jaskinia filozofów",
      "desc": "oetycki dramat Zbigniewa Herberta z 1956 r. (pierwodruk „Twórczość”, 1956 nr 9). Akcja sztuki rozgrywa się w Atenach czasów Sokratesa i ukazuje ostatnie trzy dni życia greckiego filozofa. Zasadniczy temat utworu Herbert zaczerpnął z platońskich Dialogów (zwłaszcza z Fedona i Kritona), ale zbudował odmienny od klasycznego wizerunek Sokratesa. Bohater dramatu Herberta zachowuje postawę etyczną greckiego filozofa, tzn. przyjmuje niesprawiedliwy wyrok, odrzuca pokusę ucieczki z więzienia i godnością wypija cykutę. Inaczej jednak niż historyczny Sokrates przeżywa kryzys filozoficzny. Na kilkadziesiąt godzin przed śmiercią przekonuje się bowiem, że głoszona przez niego nauka zawarta w równaniu „rozum = dobro = szczęście” nie wytrzymuje próby życia. Sokratesa odwiedza Wysłannik Rady i posługując się jego własną metodą dochodzenia do prawdy udowadnia fałsz, zaś konsekwencją jego rozumowania jest zło, które uderza w filozofa. Z kolei uczniowie Sokratesa",
      "years": 2022,
      "rating": [
        5
      ],
      "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Zbigniew_Herbert_by_Zbigniew_Kresowaty.jpg/220px-Zbigniew_Herbert_by_Zbigniew_Kresowaty.jpg",
      "id": 8
    }
  ],
  "author": [
    {
      "id": 1,
      "author": "Adam Mickiewicz",
      "nota": "Polski poeta, działacz polityczny, publicysta, tłumacz, filozof, działacz religijny, mistyk, organizator i dowódca wojskowy, nauczyciel akademicki."
    },
    {
      "id": 3,
      "author": "Henryk sienkiewicz",
      "nota": "Herbu Oszyk, pseudonim „Litwos”, „Musagetes”, „Juliusz Polkowski”, „K. Dobrzyński” – polski nowelista, powieściopisarz i publicysta; laureat Nagrody Nobla w dziedzinie literatury za całokształt twórczości, jeden z najpopularniejszych polskich pisarzy przełomu XIX i XX w."
    },
    {
      "id": 2,
      "author": "Bolesław Prus",
      "nota": "Polski pisarz, prozaik, nowelista i publicysta okresu pozytywizmu, współtwórca polskiego realizmu, kronikarz Warszawy, myśliciel i popularyzator wiedzy, działacz społeczny, propagator turystyki pieszej i rowerowej. Jeden z najwybitniejszych i najważniejszych pisarzy w historii literatury polskiej."
    },
    {
      "author": "Jan Kochanowski",
      "nota": "Dokładna data urodzenia Jana Kochanowskiego nie jest znana. Większość badaczy wskazuje na 1530 rok[b]. Ojcem był Piotr Kochanowski herbu Korwin, komornik graniczny radomski i sędzia ziemski sandomierski a matką – Anna, córka Jakuba Białaczowskiego herbu Odrowąż z Dąbrówki Podlężnej. Z małżeństwa Piotra i Anny urodziło się jedenaścioro dzieci – cztery córki (Katarzyna, Elżbieta, Jadwiga, Anna) i siedmiu synów (Kasper, Jan, Piotr, Mikołaj – poeta, Andrzej – tłumacz Eneidy Wergiliusza, Jakub, Stanisław)[13]. Bratanek Jana Kochanowskiego, Piotr Kochanowski, przełożył Orlanda szalonego Ludovico Ariosta i Jerozolimę wyzwoloną Torquato Tassa.",
      "id": 4
    },
    {
      "author": "",
      "nota": "Brak informacji o ",
      "id": 5
    },
    {
      "author": "Bl",
      "nota": "Brak informacji o Bl",
      "id": 6
    },
    {
      "author": "Blanka Lipińska",
      "nota": "Urodziła i wychowywała się w Puławach[2]. Jest córką Grzegorza i Małgorzaty[3]. Ma starszego o rok brata Jakuba[2].\n\nJest absolwentką Liceum Ogólnokształcącego nr VI Zespołu Szkół nr 3 w Puławach. Po maturze uczyła się w studium kosmetycznym, po którego ukończeniu została wizażystką. W 2007 przeprowadziła się do Warszawy, gdzie pracowała jako specjalistka i menedżerka w działach sprzedaży i marketingu firm z branży hotelarskiej. W 2012 dołączyła do federacji KSW, w której zajmowała się rekrutacją i szkoleniem tzw. „ring girls”, czyli kobiet, które wchodzą na ring między rundami walk. Równolegle w latach 2015–2016 była menedżerką odpowiedzialną za rezerwacje w nocnych klubach w Sopocie: The Roof, Show, Dream Club, The Star. W 2016 przeprowadziła się do Poznania[6], a rok później zamieszkała w Al-Dżunie w Egipcie. W 2018 wróciła do Warszawy, a rok później odeszła z KSW.",
      "id": 7
    },
    {
      "author": "wwww",
      "nota": "Brak informacji o wwww",
      "id": 8
    },
    {
      "author": "Peter V. Brett ",
      "nota": "amerykański pisarz fantasy. Autor cyklu demonicznego, który rozpoczął wydanym w 2008 roku tomem Malowany człowiek. Od dzieciństwa był fanem fantastyki, komiksów i gier fabularnych. W 1995 roku ukończył literaturę angielską i historię sztuki na Uniwersytecie Buffalo",
      "id": 9
    },
    {
      "author": "Stanisław Lem",
      "nota": "(ur. 12 lub 13 września 1921 we Lwowie, zm. 27 marca 2006 w Krakowie[2]) – polski pisarz gatunku hard science fiction, filozof, futurolog oraz krytyk.\n\nJego debiutem książkowym była wydana w 1951 roku powieść Astronauci. Kolejne powieści fantastycznonaukowe jego autorstwa to: Obłok Magellana (1955), Eden (1959), Pamiętnik znaleziony w wannie (1961), Powrót z gwiazd (1961), Solaris (1961), Niezwyciężony (1964), Głos Pana (1968), Wizja lokalna (1982), Fiasko (1987) i Pokój na Ziemi (1987). Był również autorem trylogii Czas nieutracony (1955) oraz cykli opowiadań fantastycznonaukowych: Dzienniki gwiazdowe (1957), Księga robotów (1961), Bajki robotów (1964), Cyberiada (1965), Opowieści o pilocie Pirxie (1968). Napisał recenzje nieistniejących książek (Doskonała próżnia, 1971), a także wstępy do nieistniejących dzieł (Wielkość urojona, 1973). Jest autorem zbiorów esejów, felietonów i publicystyki literackiej, w tym: Wejście na orbitę (1962), Summa technologiae (1964), Filozofia przypadku (1968), Fantastyka i futurologia (1970), Rozprawy i szkice (1975).",
      "id": 10
    },
    {
      "author": "Zbigniew Herbert",
      "nota": " (ur. 29 października 1924 we Lwowie, zm. 28 lipca 1998 w Warszawie) – polski poeta, eseista, dramaturg, twórca cyklu poetyckiego „Pan Cogito”, autor słuchowisk; pośmiertnie odznaczony Orderem Orła Białego. Z wykształcenia ekonomista, prawnik i filozof.",
      "id": 11
    }
  ]
}